Tekla Open API Reference for Tekla Structures 2025
ContourPlate.GetContourPolycurve Method
 Get contour as polycurve
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polycurve GetContourPolycurve()
Public Function GetContourPolycurve As Polycurve
Return Value
Type: Polycurve
Polycurve instance or null
See Also
Reference
ContourPlate Class
Tekla.Structures.Model Namespace